"use client";
import { useAppContext } from "@/context/app";

const AboutUs = () => {
  const { theme } = useAppContext();
  return (
    <div
      className="w-full h-full px-6 py-12 pt-[140px] slide-in-top"
      style={{ color: theme.text }}
    >
      <div className="max-w-4xl mx-auto">
        <div className="mt-8">
          <h2 className="text-2xl mb-4 font-semibold">
            100+ წარმატებული ღონისძიება
          </h2>
          <p className="text-lg">
            ჩვენი გუნდი, რომელიც ოპერირებს უკვე 8 წელიწადზე მეტი დროის
            განმავლობაში, დაგეხმარებათ თქვენი ოცნებების განხორციელებაში. 100-ზე
            მეტი წარმატებით ჩატარებული ღონისძიება ჩვენი პროფესიონალიზმისა და
            გამოცდილების დასტურია.
          </p>
        </div>

        <div className="mt-8">
          <h2 className="text-2xl mb-4 font-semibold">
            8 წელი ოპერირება მსოფლიოს ბაზარზე
          </h2>
          <p className="text-lg">
            ჩვენ ვმუშაობთ გლობალურ ბაზარზე და ვთავაზობთ ჩვენს სერვისებს
            სხვადასხვა ქვეყნებში. ჩვენი მრავალპროფილური გამოცდილება უზრუნველყოფს
            საუკეთესო მომსახურებას მსოფლიოს ნებისმიერ წერტილში.
          </p>
        </div>

        <div className="mt-8">
          <h2 className="text-2xl mb-4 font-semibold">
            ხარისხი, მომხმარებლის მოთხოვნები და ინოვაციები
          </h2>
          <p className="text-lg">
            ჩვენი მთავარი პრიორიტეტია მაღალი ხარისხი. ჩვენ ყოველთვის
            ვითვალისწინებთ მომხმარებლის მოთხოვნებს და ვცდილობთ მათ
            დაკმაყოფილებას ინოვაციური მიდგომებითა და უახლესი ტექნოლოგიებით.
            ჩვენი სერვისები გათვალისწინებულია, რომ თქვენი ღონისძიება იყოს
            უნიკალური და დაუვიწყარი.
          </p>
        </div>

        <div className="mt-8">
          <h2 className="text-2xl mb-4 font-semibold">მრავალენოვანი გუნდი</h2>
          <p className="text-lg">
            ჩვენი გუნდი მრავალენოვანია, რაც საშუალებას გვაძლევს უკეთესად
            ვიმუშაოთ საერთაშორისო მომხმარებლებთან. ჩვენ მზად ვართ უზრუნველვყოთ
            კომფორტული და ეფექტური კომუნიკაცია, მიუხედავად იმისა, თუ რომელ ენაზე
            საუბრობთ თქვენ და თქვენი სტუმრები.
          </p>
        </div>

        <div className="mt-8">
          <h2 className="text-2xl mb-4 font-semibold">
            ჩვენთან თანამშრომლობა ნიშნავს
          </h2>
          <ul className="list-disc pl-5 text-lg">
            <li>პროფესიონალიზმს ყველა ეტაპზე</li>
            <li>მაღალ ხარისხს და დეტალებისადმი ყურადღებას</li>
            <li>ინდივიდუალურ მიდგომას თითოეული მომხმარებლისადმი</li>
            <li>
              ინოვაციურ გადაწყვეტილებებს, რომლებიც თქვენს ღონისძიებას გამორჩეულს
              გახდის
            </li>
          </ul>
        </div>

        <div className="mt-8">
          <p className="text-lg">
            ჩვენი მიზანია, თითოეული ღონისძიება იყოს უნიკალური, დასამახსოვრებელი
            და წარმატებული. მოდით, ერთად შევქმნათ მომავალი თქვენი
            ღონისძიებისთვის!
          </p>
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
